// ------------- объект с датой и временем -------------
var nowIsDate = new Date();
var whatTime = {
    Year: nowIsDate.getFullYear(),
    Month: nowIsDate.getMonth(),
    Day: nowIsDate.getDate(),
    Hours: nowIsDate.getHours(),
    Minutes: nowIsDate.getMinutes()
};

// ------------------ массивы с днями -----------------
var month = ["Январь",
        "Февраль",
        "Март",
        "Апрель",
        "Май",
        "Июнь",
        "Июль",
        "Август",
        "Сентябрь",
        "Октябрь",
        "Ноябрь",
        "Декабрь"],

    howMenyDays = [31,					// Январь
        intercalaryYear(),	// Февраль
        31,					// Март
        30,					// Апрель
        31,					// Май
        30,					// Июнь
        31,					// Июль
        31,					// Август
        30,					// Сентябрь
        31,					// Октябрь
        30,					// Ноябрь
        31],				// Декабрь

    week = ["Понедельник",
        "Вторник",
        "Среда",
        "Четверг",
        "Пятница",
        "Суббота",
        "Воскресенье"];
